[
	{
		"id": "http://zotero.org/users/3808536/items/KD6SVME7",
		"type": "book",
		"image" : "https://images-na.ssl-images-amazon.com/images/I/41aWGg6a8EL._SL200_.jpg",
		"title": "About Face: The Essentials of Interaction Design, 4th Edition",
		"author": [
			{
				"family": "Cooper",
				"given": "Alan"
			},
			{
				"family": "Reimann",
				"given": "Robert"
			},
			{
				"family": "Cronin",
				"given": "David"
			},
			{
				"family": "Noessel",
				"given": "Christopher"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2014",
					9
				]
			]
		}

	},
	{
		"id": "http://zotero.org/users/3808536/items/AFPJJ669",
		"type": "book",
		"title": "Interaction Design: Beyond Human-Computer Interaction",
		"publisher": "Wiley",
		"publisher-place": "Chichester",
		"image" : "https://images-na.ssl-images-amazon.com/images/I/51avUtKUdtL._SL200_.jpg",
		"number-of-pages": "584",
		"edition": "4 edition",
		"source": "Amazon",
		"event-place": "Chichester",
		"abstract": "A new edition of the #1 text in the Human Computer Interaction field!  Hugely popular with students and professionals alike, Interaction Design is an ideal resource for learning the interdisciplinary skills needed for interaction design, human–computer interaction, information design, web design and ubiquitous computing.  This text offers a cross-disciplinary, practical and process-oriented introduction to the field, showing not just what principles ought to apply to interaction design, but crucially how they can be applied. An accompanying website contains extensive additional teaching and learning material including slides for each chapter, comments on chapter activities and a number of in-depth case studies written by researchers and designers.",
		"ISBN": "978-1-119-02075-2",
		"shortTitle": "Interaction Design",
		"language": "English",
		"author": [
			{
				"family": "Preece",
				"given": "Jenny"
			},
			{
				"family": "Sharp",
				"given": "Helen"
			},
			{
				"family": "Rogers",
				"given": "Yvonne"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2015",
					5,
					26
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/3808536/items/M52S4HPR",
		"type": "book",
		"title": "Hooked: How to Build Habit-Forming Products",
		"publisher": "Portfolio",
		"publisher-place": "New York, New York",
		"number-of-pages": "256",
		"edition": "1 edition",
		"source": "Amazon",
		"event-place": "New York, New York",
		"abstract": "How do successful companies create products people can’t put down?Why do some products capture widespread attention while others flop? What makes us engage with certain products out of sheer habit? Is there a pattern underlying how technologies hook us?Nir Eyal answers these questions (and many more) by explaining the Hook Model—a four-step process embedded into the products of many successful companies to subtly encourage customer behavior. Through consecutive “hook cycles,” these products reach their ultimate goal of bringing users back again and again without depending on costly advertising or aggressive messaging.Hooked is based on Eyal’s years of research, consulting, and practical experience. He wrote the book he wished had been available to him as a start-up founder—not abstract theory, but a how-to guide for building better products. Hooked is written for product managers, designers, marketers, start-up founders, and anyone who seeks to understand how products influence our behavior.Eyal provides readers with:• Practical insights to create user habits that stick.• Actionable steps for building products people love.• Fascinating examples from the iPhone to Twitter, Pinterest to the Bible App, and many other habit-forming products.",
		"ISBN": "978-1-59184-778-6",
		"image": "https://pictures.abebooks.com/isbn/9781591847786-us.jpg",
		"shortTitle": "Hooked",
		"language": "English",
		"author": [
			{
				"family": "Eyal",
				"given": "Nir"
			}
		],
		"editor": [
			{
				"family": "Hoover",
				"given": "Ryan"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2014",
					11,
					4
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/3808536/items/S4AHEGNC",
		"type": "book",
		"title": "The Design of Everyday Things: Revised and Expanded Edition",
		"publisher": "Basic Books",
		"publisher-place": "New York, New York",
		"number-of-pages": "368",
		"edition": "Rev Exp edition",
		"source": "Amazon",
		"event-place": "New York, New York",
		"abstract": "Even the smartest among us can feel inept as we fail to figure out which light switch or oven burner to turn on, or whether to push, pull, or slide a door. The fault, argues this ingenious—even liberating—book, lies not in ourselves, but in product design that ignores the needs of users and the principles of cognitive psychology. The problems range from ambiguous and hidden controls to arbitrary relationships between controls and functions, coupled with a lack of feedback or other assistance and unreasonable demands on memorization. The Design of Everyday Things shows that good, usable design is possible. The rules are simple: make things visible, exploit natural relationships that couple function and control, and make intelligent use of constraints. The goal: guide the user effortlessly to the right action on the right control at the right time.In this entertaining and insightful analysis, cognitive scientist Don Norman hails excellence of design as the most important key to regaining the competitive edge in influencing consumer behavior. Now fully expanded and updated, with a new introduction by the author, The Design of Everyday Things is a powerful primer on how—and why—some products satisfy customers while others only frustrate them.",
		"ISBN": "978-0-465-05065-9",
		"shortTitle": "The Design of Everyday Things",
		"image": "https://images-na.ssl-images-amazon.com/images/I/410RTQezHYL._SL200_.jpg",
		"language": "English",
		"author": [
			{
				"family": "Norman",
				"given": "Don"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2013",
					11,
					5
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/3808536/items/24UAARVN",
		"type": "book",
		"title": "OBSERVING THE USER EXPERIENCE A PRACTITIONER'S GUIDE TO USER RESEARCH",
		"publisher": "Elsevier Science & Technology",
		"edition": "2nd Revised edition edition",
		"image" : "https://images-na.ssl-images-amazon.com/images/I/51jVKjwOL2L._SL200_.jpg",
		"source": "Amazon",
		"author": [
			{
				"family": "Goodman",
				"given": "Elizabeth"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2012",
					10,
					22
				]
			]
		}
	}
]